README.org
#+TITLE: Doom Emacs config
#+AUTHOR: João Luís Teixeira Pinto
* Doom Emacs config
** _
This file is a literate configuration of my Doom Emacs config.

Here are the Emacs LISP code that config Emacs and also the explanation of every part of the config.

In addition to that, I also document here how I use, or intend to use, such configuration.
** Getting Started Guide
https://github.com/hlissner/doom-emacs/blob/master/docs/getting_started.org
* Notes about configuring Doom Emacs
Taken from the Doom Emacs github page
** _
You can configure Doom by tweaking the files found in your =DOOMDIR=. Doom
expects this directory to be found in one of:

=~/.config/doom= (respects =$XDG_CONFIG_HOME)= or =~/.doom.d= This directory is
referred to as your =DOOMDIR=. Only one of these directories should exist (Doom
will only recognize one).

Change the =DOOMDIR= environment variable to change where Doom looks for this
directory. Symlinks will work as well.

When you ran =doom install=, it deployed a simple Doom configuration to your
=DOOMDIR=, comprised of these three files:
** init.el
Where you’ll find your =doom!= block, which controls what Doom modules are
enabled and in what order they will be loaded.

This file is evaluated early when Emacs is starting up; before any other module
has loaded. You generally shouldn’t add code to this file unless you’re
targeting Doom’s CLI or something that needs to be configured very early in the
startup process.
** config.el
Here is where 99.99% of your private configuration should go. Anything in here
is evaluated after all other modules have loaded, when starting up Emacs.
** packages.el
Package management is done from this file; where you’ll declare what packages to
install and where from.
*** Note:
do not use =M-x customize= or the customize API in general. Doom is designed to
be configured programmatically from your config.el, which can conflict with
Customize’s way of modifying variables.

If you’re concerned about =defcustom= setters, Doom has a =setq!= macro that
will trigger them.
** the doom binary CLI utility
This utility is your new best friend. It won’t spot you a beer, but it’ll
shoulder much of the work associated with managing and maintaining your Doom
Emacs configuration, and then some. Not least of which is installation of and
updating Doom and your installed packages.

It exposes a variety of commands. =bin/doom= help will list them all, but here
is a summary of the most important ones:

- =doom sync=: This synchronizes your config with Doom Emacs. It ensures that
  needed packages are installed, orphaned packages are removed and necessary
  metadata correctly generated. Run this whenever you modify your =doom!= block
  or =packages.el= file. You’ll need =doom sync -u= if you override the recipe
  of package installed by another module.

- =doom upgrade=: Updates Doom Emacs (if available) and all its packages.

- =doom env=: (Re)generates an “envvar file”, which is a snapshot of your shell
  environment that Doom loads at startup. If your app launcher or OS launches
  Emacs in the wrong environment you will need this. **This is required for GUI
  Emacs users on MacOS.**

- =doom doctor=: If Doom misbehaves, the doc will diagnose common issues with
  your installation, system and environment.

- =doom purge=: Over time, the repositories for Doom’s plugins will accumulate.
  Run this command from time to time to delete old, orphaned packages, and with
  the =-g= switch to compact existing package repos.

Use =doom help= to see an overview of the available commands that =doom=
provides, and =doom help COMMAND= to display documentation for a particular
=COMMAND=.

I recommend you add =~/.emacs.d/bin= to your =PATH= so you can call =doom=
directly and from anywhere. Accomplish this by adding this to your .bashrc or
.zshrc file: ~export PATH=”$HOME/.emacs.d/bin:$PATH”~
* notes about elisp
** symbols
symbols in lisp stat with a ='= like:
#+begin_src elisp
(a 'symbol)
#+end_src
** lisp learning resources
*** It is not hard to read Lisp code
https://yoo2080.wordpress.com/2014/07/04/it-is-not-hard-to-read-lisp-code/
** Parinfer
https://shaunlebron.github.io/parinfer/
** Inspiring a future Clojure editor with forgotten Lisp UX - Shaun Lebron
https://www.youtube.com/watch?v=K0Tsa3smr1w&t=532s
** Don't make a habit of putting close-parentheses on lines by themselves; Lisp programmers find this disconcerting.
https://www.reddit.com/r/emacs/comments/f6q4yx/dont_make_a_habit_of_putting_closeparentheses_on/
* content about Emacs configs to check out
** David Wilson (system crafters)
*** youtube
**** channel link
https://www.youtube.com/c/SystemCrafters/videos
**** playlists
***** Emacs From Scratch (old)
https://www.youtube.com/playlist?list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ
****** DONE 1 Getting Started with a Basic Usable Configuration
******* 0 introduction
******* 2:40 how I use Emacs
******* 6:40 start
******* 11:20 start of configuration
******* 13:40 font style config
******* 19:15 ...
******* 22:00 ~ package sources
Doom does not install packages this way, it uses straight instead
******* 27:00 command log mode
******* 31:00 ~ completion frameworks
ivy or helm, etc
******* 33:00 ~ counsel shenanigans
******* 36:00 M-x explanation
******* 37:00 counsel load theme
******* 39:00 use package
******* 40:00 modeline
******* 42:58 swiper
******* 44:00 caps as ctrl
******* 47:00 modeline 2nd time
****** 2 Adding Helpful UI Improvements
****** 3 Key Bindings and Evil
****** 4 Projectile and Magit
****** 5 Org Mode Basics
****** 6 Organize Your Life with Org Mode
****** 7 Configure Everything with Org Babel
****** 8 Build Your Own IDE with lsp-mode
****** 9 Learn to Love the Terminal Modes
****** 10 Effortless File Management with Dired
****** 11 Keeping Your Emacs Packages Up To Date
****** 12 How to Cut Emacs Start Up Time in Half!
***** Emacs Tips
****** SKIP 1 How to Show Reminders for Org Mode Tasks
******* NO org alert
System notifications of org agenda items
https://github.com/spegoraro/org-alert

- no way of configuring how much time before the notification will play
******* NO org wild notifier
- dont fire reliably
******* NO org notify
cant install on doom
****** 2 How to Create Your Own Color Theme
****** 3 How to Use File and Directory Local Variables
****** 4 How to Give Presentations with Org Mode
****** 5 How to Create and Manage Multiple Windows - Emacs Tips
****** 6 Organize Your Windows with the Tab Bar in Emacs 27
****** 7 Dynamic Tiling Windows like dwm in Emacs with Edwina
****** 8 Unlock the Power of the Daemon with emacsclient
****** 9 Give Emacs Psychic Completion Powers with prescient.el
****** 10 Teach Emacs to Keep Your Folders Clean
****** 11 How to Encrypt Your Passwords with Emacs
****** 12 Hey Emacs, Don't Move My Windows! - Customizing display-buffer's behavior
****** 13 Streamline Your Emacs Completions with Vertico
****** 14 Doom Emacs or Spacemacs? Use both with Chemacs2!
***** Emacs IDE
****** 1 Emacs From Scratch #8 - Build Your Own IDE with lsp-mode
****** 2 How to Debug Your Code with dap-mode
****** 3 Python Development Configuration
***** Learning Emacs Lisp
****** 1 Introduction to Emacs Lisp - Learning Emacs Lisp #1
****** 2 Types, Conditionals, and Loops - Learning Emacs Lisp #2
****** 3 Defining Functions and Commands - Learning Emacs Lisp #3
****** 4 Defining Variables and Scopes - Learning Emacs Lisp #4
****** 5 Reading and Writing Buffers in Practice - Learning Emacs Lisp #5
****** 6 Managing Files and Directories in Practice - Learning Emacs Lisp #6
****** 7 Creating Custom Minor Modes - Learning Emacs Lisp #7
***** Managing Your Dotfiles
****** 1 The Basics of Dotfiles
****** 2 How to Create a Dotfiles Folder
****** 3 Give Your Dotfiles a Home with GNU Stow
***** Emacs Essentials
****** 1 The Absolute Beginner's Guide to Emacs
****** 2 Efficient Movement with Emacs Key Bindings - Emacs Essentials #2
****** 3 Efficient Text Selection with Emacs Key Bindings - Emacs Essentials #3
***** System Crafters Live!
****** 1 System Crafters Live! - I'm creating a new Lisp • Emacs News • Q&A
****** 2 System Crafters Live! - Lisp Compiler Progress • Live Lisp Hacking • Q&A
****** 3 System Crafters Live! - Taking a look at Magit 3.0 • Streaming with Emacs Lisp
****** 4 System Crafters Live! - So you've installed GNU Guix, now what?
****** 5 System Crafters Live! - Do we really need use-package in Emacs?
****** 6 System Crafters Live! - The Future of System Crafters
****** 7 System Crafters Live! - Can You Apply Zettelkasten in Emacs?
****** 8 System Crafters Live! - Emacs Package Potluck (Trying Your Suggestions!)
****** 9 System Crafters Live! - Can We Fix a Bug in Emacs?
****** 11 System Crafters Live! - The Many Varieties of Emacs
****** 10 System Crafters Live! - The Many Varieties of Emacs (Part 2)
****** 12 System Crafters Live! - A First Look at Guix Home
****** 13 System Crafters Live! - Why Geeks Don't Use Guix
****** 14 System Crafters Live! - Building the World's WORST Emacs Configuration (Part 2)
****** 15 System Crafters Live! - Configuring Emacs With Only the UI?
****** 16 System Crafters Live! - Planning the New Emacs From Scratch
****** 17 System Crafters Live! - Live Crafting: Rational Emacs
****** 18 System Crafters Live! - Trying New Emacs Packages by Minad
***** Mastering Git with Magit
****** 1 An Introduction to the Ultimate Git Interface, Magit!
****** 2 9 Techniques to Boost Your Git Workflow with Magit
****** 3 Fix Your Git Commits Like a Rebase Expert with Magit
***** Advanced Emacs Package Management
****** 1 straight.el: Advanced Emacs Package Management
***** Effective Window Management in Emacs
****** 1 Declutter Your Buffer Lists in Emacs with Perspective.el
***** Build a Second Brain in Emacs
https://www.youtube.com/playlist?list=PLEoMzSkcN8oN3x3XaZQ-AXFKv52LZzjqD
****** 1 Getting Started with Org Roam - Build a Second Brain in Emacs
******* _
******* DONE question: how to change the name of files that it generates
change the default template
******* question: how to create a new note with the selection in evil mode
******* question: how to create a note inside a specific folder inside the org roam folder
for example a MOC folder and a note inside that

maybe I can create a template and put a folder at the beginning of the filename
****** 2 Capturing Notes Efficiently in Emacs with Org Roam
****** 3 Org Roam: The Best Way to Keep a Journal in Emacs
****** 4 5 Org Roam Hacks for Better Productivity in Emacs
***** Emacs Shorts
****** 1 Emacs Has a Built-in Pomodoro Timer?? #Shorts
***** Hack Sessions
****** 1 Improving EXWM #1 // Hack Sessions
****** 2 Improving EXWM #2 // Hack Sessions
****** 3 "Inverse Literate" Emacs Configurations - Hack Sessions
****** 4 "Inverse Literate" Emacs Configurations (Part 2) - Hack Sessions
***** Publishing Websites with Org Mode
****** 1 Build Your Website with Org Mode
****** 2 Automated Org Mode Website Publishing with GitHub or SourceHut
***** Emacs From Scratch (New)
****** 1 The Basics of Emacs Configuration
****** 2 The 6 Emacs Settings Every User Should Consider
*** github
**** home
https://github.com/daviwil
**** dotfiles
https://github.com/daviwil/dotfiles
***** Emacs.org
https://github.com/daviwil/dotfiles/blob/master/Emacs.org
****** /home/daviwil/.dotfiles Emacs Configuration
https://config.daviwil.com/emacs
******* Rebind C-u
Since I let evil-mode take over C-u for buffer scrolling, I need to re-bind the
universal-argument command to another key sequence. I'm choosing C-M-u for this
purpose.

#+begin_src emacs-lisp
(global-set-key (kbd "C-M-u") 'universal-argument)
#+end_src
******* Set Margins for Modes
#+begin_src emacs-lisp
;; (defun dw/center-buffer-with-margins ()
;;   (let ((margin-size (/ (- (frame-width) 80) 3)))
;;     (set-window-margins nil margin-size margin-size)))

(defun dw/org-mode-visual-fill ()
  (setq visual-fill-column-width 110
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :defer t
  :hook (org-mode . dw/org-mode-visual-fill))
#+end_src
******* org mode
#+begin_src emacs-lisp
;; TODO: Mode this to another section
(setq-default fill-column 80)

;; Turn on indentation and auto-fill mode for Org files
(defun dw/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (setq evil-auto-indent nil)
  (diminish org-indent-mode))

;; Make sure Straight pulls Org from Guix
(when dw/is-guix-system
  (straight-use-package '(org :type built-in)))

(use-package org
  :defer t
  :hook (org-mode . dw/org-mode-setup)
  :config
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t
        org-src-fontify-natively t
        org-fontify-quote-and-verse-blocks t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 2
        org-hide-block-startup nil
        org-src-preserve-indentation nil
        org-startup-folded 'content
        org-cycle-separator-lines 2)

  (setq org-modules
    '(org-crypt
        org-habit
        org-bookmark
        org-eshell
        org-irc))

  (setq org-refile-targets '((nil :maxlevel . 1)
                             (org-agenda-files :maxlevel . 1)))

  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-use-outline-path t)

  (evil-define-key '(normal insert visual) org-mode-map (kbd "C-j") 'org-next-visible-heading)
  (evil-define-key '(normal insert visual) org-mode-map (kbd "C-k") 'org-previous-visible-heading)

  (evil-define-key '(normal insert visual) org-mode-map (kbd "M-j") 'org-metadown)
  (evil-define-key '(normal insert visual) org-mode-map (kbd "M-k") 'org-metaup)

  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (ledger . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)

  ;; NOTE: Subsequent sections are still part of this use-package block!
#+end_src
