README.org
***** bug
Error in private config: config.el, (void-function org-roam-db-autosync-mode)

workaround : (require 'ucs-normalize)
**** transclusion
#+begin_src emacs-lisp :tangle ./config.el
;; start ------------------------------------------------------ org / transclusion
(use-package! org-transclusion
  :after org
  ;; :init
  ;; (map!
  ;;  :map global-map "<f12>" #'org-transclusion-add
  ;;  :leader
  ;;  :prefix "n"
  ;;  :desc "Org Transclusion Mode" "t" #'org-transclusion-mode)
)
;; start ------------------------------------------------------ org / transclusion
#+end_src
*** Projects
**** YES projectile

... #+begin_src elisp
#+begin_src emacs-lisp :tangle ./config.el
(setq projectile-indexing-method 'alien) ;; default value
(setq projectile-auto-discover t)        ;; default value
(setq projectile-sort-order 'recentf)

(setq projectile-project-search-path '(
                                       ("~/Dropbox" . 10)
                                       ("~/Config" . 3)
;;                                       ("~/github" . 1) ;; depth = 1
                                      )
)
#+end_src
***** docs for projectile-project-search-path
projectile-project-search-path is a variable defined in ‘projectile.el’.

Its value is nil

List of folders where projectile is automatically going to look for projects.
You can think of something like $PATH, but for projects instead of executables.
Examples of such paths might be ~/projects, ~/work, (~/github . 1) etc.

For elements of form (DIRECTORY . DEPTH), DIRECTORY has to be a
directory and DEPTH an integer that specifies the depth at which to
look for projects.  A DEPTH of 0 means check DIRECTORY.  A depth of 1
means check all the subdirectories of DIRECTORY.  Etc.
*** UI
**** Interface
***** NO scroll bar
****** code
put the scrollbar on the right back on
... #+begin_src emacs-lisp :tangle ./config.el
#+begin_src emacs-lisp
;; start ---------------------------------- UI / Interface / Scrollbar
(scroll-bar-mode t)
(setq scroll-bar ('foreground nil))
;; end ---------------------------------- UI / Interface / Scrollbar
#+end_src
****** documentation
Basic face for the scroll bar colors under X.

Defined in ‘faces.el’.


           Family: unspecified
          Foundry: unspecified
            Width: unspecified
           Height: unspecified
           Weight: unspecified
            Slant: unspecified
       Foreground: white
DistantForeground: unspecified
       Background: unspecified
        Underline: unspecified
         Overline: unspecified
   Strike-through: unspecified
              Box: unspecified
          Inverse: unspecified
          Stipple: unspecified
             Font: unspecified
          Fontset: unspecified
           Extend: unspecified
          Inherit: unspecified

  This face was introduced, or its default value was changed, in
  version 28.1 of Emacs.
***** NO yascroll
****** link
https://github.com/emacsorphanage/yascroll
****** description
scrollbar that shows only when the screen is moving
****** code
.. #+begin_src emacs-lisp
#+begin_src emacs-lisp :tangle ./config.el
;; start ---------------------------------- UI / Interface / Scrollbar
;;(global-yascroll-bar-mode t)
;; end ---------------------------------- UI / Interface / Scrollbar
#+end_src
**** lines
***** NO move point through long lines one visual line at a time
****** code
... #+begin_src emacs-lisp :tangle ./config.el
#+begin_src emacs-lisp
;; start ---------------------------------- UI / lines
(define-key evil-normal-state-map
  (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
(define-key evil-normal-state-map
  (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
(define-key evil-motion-state-map
  (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
(define-key evil-motion-state-map
  (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
; Make horizontal movement cross lines
(setq-default evil-cross-lines t)
;; end ------------------------------------ UI / lines
#+end_src
****** documentation
evil-cross-lines is a variable defined in ‘evil-vars.el’.

Its value is nil

Whether horizontal motions may move to other lines.

If non-nil, certain motions that conventionally operate in a single line may
move the cursor to other lines.

Otherwise, they are restricted to the current line.

This applies to h, SPC, f, F, t, T, ~.
***** NO Evil Better Visual Line
****** site
https://github.com/YourFin/evil-better-visual-line
****** code
#+begin_src emacs-lisp :tangle ./config.el
;; start ---------------------------------- UI / lines / Evil Better Visual Line
;; (after! evil
;;   (evil-better-visual-line-on)
;; )
;; end ------------------------------------ UI / lines / Evil Better Visual Line
#+end_src
**** YES which key
***** YES bigger
****** code
... #+begin_src emacs-lisp
#+begin_src emacs-lisp :tangle ./config.el
;; start ---------------------------------- UI / which key / on the right side
;;(after! which-key
;; (which-key-setup-side-window-right)

;; (setq which-key-popup-type 'side-window)
;; (setq which-key-side-window-location 'bottom)
;; (setq which-key-side-window-max-width 0.33)
;; (setq which-key-side-window-max-height 0.25)

(setq which-key-side-window-max-height 0.60)
(setq which-key-idle-delay 0)

(setq which-key-prefix-prefix "📁" )
;;)
;; end ------------------------------------ UI / which key / on the right side
#+end_src
**** NO centered-window-mode
didn't work

... #+begin_src emacs-lisp :tangle ./config.el
#+begin_src emacs-lisp :tangle no
;; start ------------------------------------------------------ UI / centered-window-mode
(use-package! centered-window-mode
  :init (centered-window-mode)
)
;; end -------------------------------------------------------- UI / centered-window-mode
#+end_src
**** MAYBE add margins on both sides
the problem with it is that it applies those margins everywhere

... #+begin_src emacs-lisp :tangle ./config.el
#+begin_src emacs-lisp :tangle no
;; start ------------------------------------------------------ UI / margins
;; (setq-default
;;   left-margin-width  5
;;   right-margin-width 5
;; )
;; (set-window-buffer nil
;;                    (current-buffer)
;; ) ; Use them now.
;; end -------------------------------------------------------- UI / margins
#+end_src
*** Keybindings
** packages.el
#+begin_src emacs-lisp :tangle ./packages.el

#+end_src
*** Example usage
**** _
To install a package with Doom you must declare them here and *run =doom sync=
on the command line*, then restart Emacs for the changes to take effect -- or
use =M-x doom/reload=.

#+begin_src emacs-lisp :tangle ./packages.el

;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+end_src

**** packages from MELPA, ELPA or emacsmirror

To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:

#+begin_src emacs-lisp :tangle ./packages.el
;(package! some-package)
#+end_src

**** package from git

To install a package directly from a remote git repo, you must specify a
`:recipe'. You'll find documentation on what `:recipe' accepts here:
https://github.com/raxod502/straight.el#the-recipe-format

#+begin_src emacs-lisp :tangle ./packages.el
;(package! another-package
;  :recipe (:host github :repo "username/repo"))
#+end_src

**** package without PACKAGENAME.el, or in subdirecotry of the repo

If the package you are trying to install does not contain a PACKAGENAME.el
file, or is located in a subdirectory of the repo, you'll need to specify
`:files' in the `:recipe':

#+begin_src emacs-lisp :tangle ./packages.el
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))
#+end_src

**** disable a package included with Doom

If you'd like to disable a package included with Doom, you can do so here
with the `:disable' property:

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :disable t)
#+end_src

**** overriding the recipe of a built in package

You can override the recipe of a built in package without having to specify
all the properties for `:recipe'. These will inherit the rest of its recipe
from Doom or MELPA/ELPA/Emacsmirror:

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))
#+end_src

**** package from a particular branch or tag

Specify a `:branch' to install a package from a particular branch or tag.
This is required for some packages whose default branch isn't 'master' (which
our package manager can't deal with; see raxod502/straight.el#279)

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :recipe (:branch "develop"))
#+end_src

**** specify a particular commit
Use `:pin' to specify a particular commit to install.

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :pin "1a2b3c4d5e")
#+end_src

**** unpin (Doom) packages
***** single package

Doom's packages are pinned to a specific commit and updated from release to
release. The `unpin!' macro allows you to unpin single packages...

#+begin_src emacs-lisp :tangle ./packages.el
;(unpin! pinned-package)
#+end_src

***** multiple package

...or multiple packages

#+begin_src emacs-lisp :tangle ./packages.el
;(unpin! pinned-package another-pinned-package)
#+end_src

***** all packages

...Or *all* packages (NOT RECOMMENDED; will likely break things)

#+begin_src emacs-lisp :tangle ./packages.el
;(unpin! t)
#+end_src

*** NO benchmark startup time
... #+begin_src emacs-lisp :tangle ./packages.el
#+begin_src emacs-lisp :tangle no
;;(package! benchmark-init)
#+end_src
*** org
**** NO disable org-fancy-priorities
#+begin_src emacs-lisp :tangle ./packages.el
;; start ------------------------------------------------ org / org-fancy-priorities
(package!
  org-fancy-priorities
  :disable t
)
;; end -------------------------------------------------- org / org-fancy-priorities
#+end_src
**** YES org-appear

#+begin_src emacs-lisp :tangle ./packages.el
;; start --------------------------------------------------------- org / org-appear
(package!
  org-appear
)
;; end ----------------------------------------------------------- org / org-appear
#+end_src
**** YES org-super-agenda

#+begin_src emacs-lisp :tangle ./packages.el
;; start ---------------------------------------------- org / org-super-agenda
(package!
  org-super-agenda
)
;; end ---------------------------------------------- org / org-super-agenda
#+end_src
**** YES org-transclusion

#+begin_src emacs-lisp :tangle ./packages.el
;; start ---------------------------------------------- org / transclusion
;; ~/.doom.d/package.el
(package! org-transclusion)
;; end ---------------------------------------------- org / transclusion
#+end_src
**** YES org-ref

#+begin_src emacs-lisp :tangle ./packages.el
;; start ---------------------------------------------- org / ref
;; ~/.doom.d/package.el
(package! org-ref)
;; end ---------------------------------------------- org / ref
#+end_src
**** NO unpin org packages
... #+begin_src emacs-lisp :tangle ./packages.el
#+begin_src emacs-lisp :tangle no
;; (unpin!
;;   org
;;   org-roam
;; )
#+end_src
**** NO org-notify
... #+begin_src emacs-lisp :tangle ./packages.el
#+begin_src emacs-lisp :tangle no
;; start ---------------------------------------------- org / notify
;(package! org-plus-contrib)
;; end ---------------------------------------------- org / notify
#+end_src
*** UI
**** NO centered-window-mode
Keep your text centered when there's only one window.
...#+begin_src emacs-lisp :tangle ./packages.el
... #+begin_src emacs-lisp
#+begin_src emacs-lisp :tangle no
;; start ------------------------------------------------------- UI / centered-window-mode
(package!
  centered-window-mode
)
;; end --------------------------------------------------------- UI / centered-window-mode
#+end_src
**** NO yascroll
a better scrollbar

... #+begin_src emacs-lisp
... #+begin_src emacs-lisp :tangle ./packages.el
#+begin_src emacs-lisp :tangle no
;; start ------------------------------------------------------- UI / yascroll
;; (package!
;;   yascroll
;; )
;; end ------------------------------------------------------- UI / yascroll
#+end_src
**** NO evil-better-visual-line
creates a lot of lag

... #+begin_src emacs-lisp :tangle ./packages.el
#+begin_src emacs-lisp :tangle no
;;(package!
;;  evil-better-visual-line
;;)
#+end_src
*** Checkers
**** Grammar
***** NO writegood
... #+begin_src emacs-lisp :tangle ./packages.el
#+begin_src emacs-lisp :tangle no
;; (package! writegood-mode
;;   :disable t
;; )
#+end_src

#+print_bibliography: no
